sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=2/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=6, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=2, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=2/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=6, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=2, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=2/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 2930
#Output tokens: 3440
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 6/6 [00:20<00:00,  3.40s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 2         
Successful requests:                     6         
Benchmark duration (s):                  20.43     
Total input tokens:                      2930      
Total generated tokens:                  3440      
Total generated tokens (retokenized):    3440      
Request throughput (req/s):              0.29      
Input token throughput (tok/s):          143.44    
Output token throughput (tok/s):         168.41    
Total token throughput (tok/s):          311.84    
Concurrency:                             1.94      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6619.28   
Median E2E Latency (ms):                 7759.07   
---------------Time to First Token----------------
Mean TTFT (ms):                          98.62     
Median TTFT (ms):                        102.67    
P99 TTFT (ms):                           181.82    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.39     
Median ITL (ms):                         11.27     
P95 ITL (ms):                            11.56     
P99 ITL (ms):                            12.22     
Max ITL (ms):                            122.01    
==================================================